# ┌───────────────────────────────────────────────────────────────────────────────────────────────┐
# │                              ┌─────────────────────────────┐                                  │
# │                              │              │              │                                  │
# ├────────────────────────────────✨(Make Targets) defaults ✨───────────────────────────────────
# │                              │              │              │                                  │
# │                              └─────────────────────────────┘                                  │
# ▢-----------------------------------------------------------------------------------------------▢
# ▢		📦kv-store/ 				## ↪ 🎥[project root]										  ▢
# ▢		├── 🗂Makefile				## ├── 🎬[Root Makefile]									  ▢
# ▢		└── 🗂.make/ 				## └── 🎞️[Submodules Directory]								  ▢
# ▢			└──📍base.mk 			##	   └── 🗒️[Default Make Targets]							  ▢
# ▢-----------------------------------------------------------------------------------------------▢
# ├── base.mk 																					  │
# │   ├── help       📝 1/ Shows all targets from `.make/*.mk` files							  │
# │   ├── install    📦 2/ Install project dependencies and tools 								  │
# │   ├── update     🔄 3/ Update project dependencies to latest versions 						  │
# │   ├── clean      🧹 4/ Remove build artifacts and caches 									  │
# │   ├── build      🚀 5/ Compile/build the project 										      │
# │   ├── test       🧪 6/ Run all tests 										                  │
# │   └── lint       🔍 7/ Run linter / static analysis 									      │
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  📝SECTION 1  │			            → ['Make help'] ←								          │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: help
help: ##_helpMsg_## 📦 → List all Make targets
	@$(call PRINT_HEADER,yellow)
	@$(MAKE) styles.println.green TEXT="🗂️  .make/";
	@for mf in $(filter %.mk,$(MAKEFILE_LIST)); do \
		targets=$$(grep -E '^[[:space:]]*[a-zA-Z0-9_.%:-]+:.*?##_helpMsg_##' $$mf || true); \
		if [ ! -z "$$targets" ]; then \
			$(MAKE) styles.print.yellow TEXT="├── 💾 "; \
			$(MAKE) styles.println.green TEXT="$$(basename $$mf)"; \
			maxlen=$$(echo "$$targets" | awk -F ':.*?##' '{print length($$1)}' | sort -nr | head -1); \
			count=$$(echo "$$targets" | wc -l); \
			i=1; \
			echo "$$targets" | while read t; do \
				name=$$(echo $$t | awk -F ':.*?##_helpMsg_##' '{print $$1}'); \
				desc=$$(echo $$t | awk -F ':.*?##_helpMsg_##' '{print $$2}'); \
				padded=$$(printf "%-*s" $$maxlen $$name); \
		    	targetNum=$$(printf "%02d" $$i); \
				if [ $$i -eq $$count ]; then \
					$(MAKE) styles.print.yellow TEXT="$$targetNum   └─── $$padded"; \
					$(MAKE) styles.print.blue TEXT="\t$$desc"; \
					echo ; \
				else \
					$(MAKE) styles.print.yellow TEXT="$$targetNum   ├─── $$padded"; \
					$(MAKE) styles.print.blue TEXT="\t$$desc"; \
					echo ; \
				fi; \
				i=$$((i+1)); \
			done; \
		fi; \
	done
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  📦SECTION 2  │			           → ['Make install'] ←								          │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: install
.ONESHELL:
install: ##_helpMsg_## 📦 → Download project dependencies and install tools
	@set -e
	@$(call PRINT_HEADER,yellow)
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.1  ├─────────── → [Go Modules] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT=" - 💾 (Install #1) → Go modules"
		@$(MAKE) styles.println.line.blue
			${GO} mod download
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.2  ├─────────── → [golangc-lint] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT=" - 💾 (Install #2) → golangci-lint"
		@$(MAKE) styles.println.line.blue
			@if ! command -v golangci-lint >/dev/null 2>&1; then \
				$(MAKE) styles.println.gray TEXT=" → 🔍 [NOT FOUND] 'golangci-lint' \t→ installing..."; \
				curl -sSfL https://raw.githubusercontent.com/golangci/golangci-lint/master/install.sh | sh -s -- -b $(GOPATH)/bin $(GOLANGCI_LINT_VERSION); \
				$(MAKE) styles.println.green TEXT=" → [✅  Installed] - 'golangci-lint': \tPATH = $(GOPATH)/bin/golangci-lint"; \
			else \
				$(MAKE) styles.println.gray TEXT=" → [☑️  Skipping] - 'already installed'"; \
			fi
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.3 ├─────────── → [Package Manger] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT=" → 💾 (Install #3) → Package Manager\n"
		@$(MAKE) styles.println.line.blue
			@if ! command -v $$PKG_CMD >/dev/null 2>&1; then \
				$(MAKE) styles.println.gray TEXT=" → 🔍 [NOT FOUND] 'Package Manager' \t→ installing..."; \
				/bin/bash -c "$$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"; \
				$(MAKE) styles.println.green TEXT=" → [Installed] - ✅  'Package Manager'"; \
			else \
				$(MAKE) styles.println.gray TEXT=" → [Skipping] - ☑️  'already installed'"; \
			fi
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.4  ├─────────── → [buf CLI] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT=" → 💾 (Install #4) → Buf – (protobuf code generator)"
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.print.padding
			@brew install buf || $(MAKE) styles.println.yellow TEXT=" → [Skipping] - ⚠️ 'buf' may already be installed"
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.5  ├─────────── → [fzf CLI] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="💾 (Install #5) → fzf – (interactive cli usage)"
		@$(MAKE) styles.println.line.blue
			@brew install fzf || $(MAKE) styles.println.yellow TEXT=" → [Skipping] - ⚠️ 'fzf' may already be installed"
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.6  ├─────────── → [yq CLI] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="💾 (Install #6) → yq – (diff-checks yaml files)"
		@$(MAKE) styles.println.line.blue
			@brew install yq || $(MAKE) styles.println.yellow TEXT=" → [Skipping] - ⚠️ 'yq' may already be installed"
		@#▢---------------------------------------------------------------------------------------▢
		@#└──────────┤ 📦2.7  ├─────────── → [Github CLI] ←
		@#▢---------------------------------------------------------------------------------------▢
		@$(MAKE) styles.print.padding
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT=" → 💾 (Install #7) → gh – (Github CLI)"
		@$(MAKE) styles.println.line.blue
			@brew install gh || $(MAKE) styles.println.yellow TEXT=" → [Skipping] - ⚠️ 'gh' may already be installed"
		@#▢---------------------------------------------------------------------------------------▢
	@$(call PRINT_FOOTER,green)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# 												|
# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  🔄SECTION 3  │			           → ['Make update'] ←								          │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: update
.ONESHELL:
update: ##_helpMsg_## 📦 → Update all Go module dependencies to latest versions
	@set -e
	@$(call PRINT_HEADER,yellow)
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="- [Step 1] → 🔄  Updating Go Dependencies..."
		@$(MAKE) styles.println.line.blue
			${GO} get -u ${GOPKGS}
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="- [Step 2] → 🧹  Tidying modules..."
		@$(MAKE) styles.println.line.blue
		@${GO} mod tidy
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  🧹SECTION 4  │			           → ['Make clean'] ←								          │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: clean
.ONESHELL:
clean: ##_helpMsg_## 📦 → Deep clean Go project (binary, cache, modules)
	@set -e
	@$(call PRINT_HEADER,yellow)
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="- [Step 1] → 🗑️  cleaning go cache..."
		@$(MAKE) styles.println.line.blue
			${GO} clean -modcache
		@$(MAKE) styles.println.line.blue
		@$(MAKE) styles.println.blue TEXT="- [Step 2] → 🗑️  tidying go modules..."
		@$(MAKE) styles.println.line.blue
			${GO} mod tidy
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  ✨SECTION 5  │			           → ['Make build'] ←								          │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: build
.ONESHELL:
build: ##_helpMsg_## 📦 → Build / compile project - (no output files)
	@set -e
	@$(call PRINT_HEADER,yellow)
		${GO} build ${GOPKGS}
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  ✨SECTION 5a │			           → ['Make build.binary'] ←								  │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: build.binary
build.binary:  ## 📦 → compile go binary - (for linux runtime)
	@$(call PRINT_HEADER,yellow)
	@set -e; { \
		OUTPUT_NAME="main"; \
		MAIN_FILE="./cmd/server/main.go"; \
			$(MAKE) styles.println.blue TEXT="   📂 Source : $$MAIN_FILE"; \
			$(MAKE) styles.println.blue TEXT="   📦 Output : ./$$OUTPUT_NAME"; \
		GOOS=linux GOARCH=amd64 ${GO} build -o $$OUTPUT_NAME $$MAIN_FILE; \
	}
	$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  🚀SECTION 6  │			            → ['Make test'] ←					        			  │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# ▢-----------------------------------------------------------------------------------------------▢
.PHONY: test
test: ##_helpMsg_## 📦 → Run Go tests
	@$(call PRINT_HEADER,yellow)
		${GO} test -v ${GOPKGS}
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘

# ┌┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┬┐
# ├───────────────┐			 		   			│								                  │
# │  🚀SECTION 7  │			            → ['Make lint'] ←					        			  │
# ├───────────────┘                             │											      │
# ▢───────────────────────────────────────────────────────────────────────────────────────────────▢
# └──────────────────────────────────────────────┴────────────────────────────────────────────────┘
.PHONY: lint
.ONESHELL:
lint: ##_helpMsg_## 📦 → Run linter checks
	@$(call PRINT_HEADER,yellow)
		@$(MAKE) styles.heading.blue TEXT="- [Starting] Linter Checks - (golangci-lint)"
		@$(MAKE) styles.println.gray TEXT="-\t📂 Linter Config:\t '.golangci.yaml'\n"
			golangci-lint run
	@$(call PRINT_FOOTER,yellow)
# ▢-----------------------------------------------------------------------------------------------▢
# └─────────────────────────────────────────────┴─────────────────────────────────────────────────┘